//
//  constrants.swift
//  KNU
//
//  Created by Иван on 10.03.18.
//  Copyright © 2018 Ivan. All rights reserved.
//

import Foundation





let chooseFacultaties = ["Юридичний","Історичний"]
let faculty = [juristA]
let juristA = [firstCourseDictionary, secondCourseDictionary, thirdCourseDictionary, fourthCourseDictionary]
let firstCourseDictionary = [firstGroup]
let secondCourseDictionary = [firstGroup]
let thirdCourseDictionary = [firstGroup]
let fourthCourseDictionary = [firstGroup]
let firstGroup = [upWeekForFirstGroup]
let secondGroup = [upWeekForSecondGroup]
                                             //КУРСЫ
let chooseCourse = ["1-й курс","2-й курс","3-й курс","4-й курс"]

                                            //Группы
let firstCourse = ["1 група","2 група","3 група","4 група","5 група","6 група","7 група","8 група","9 група","10 група","11 група","12 група","13 група","14 група","15 група","16 група","17 група"]

let secondCourse = ["1 група","2 група","3 група","4 група","5 група","6 група","7 група","8 група","9 група","10 група","11 група","12 група","13 група","14 група"]

let thirdCourse = ["1 група","2 група","3 група","4 група","5 група","6 група","7 група","8 група","9 група","10 група","11 група","12 група","13 група","14 група"]

let fourthCourse = ["1 група","2 група","3 група","4 група","5 група","6 група","7 група","8 група","9 група","10 група","11 група","12 група","13 група","14 група"]

let courses = [firstCourse, secondCourse, thirdCourse, fourthCourse]

struct Lessonnnnnnnnnnnnn {
    var nameOfLesson = ""
    var typeOfLesson = ""
    var teacher = ""
    var classeRoom = ""

}

let firstOfLesson = Lessonnnnnnnnnnnnn(nameOfLesson: "Цивільне право", typeOfLesson: " Лекция", teacher: "ноу нейм", classeRoom: "345")
let secondOfLesson = Lessonnnnnnnnnnnnn(nameOfLesson: "Конституційне право", typeOfLesson: "Семінар", teacher: "ноу нейм", classeRoom: "346")
let thirdOfLesson = Lessonnnnnnnnnnnnn(nameOfLesson: "Конституційне право", typeOfLesson: "Лекция", teacher: "ноу нейм", classeRoom: "389")

                                          //Предметы  второй курс-1 группа

let upWeekForFirstGroup : [String: [Lessonnnnnnnnnnnnn]] =
    ["ПН" : [firstOfLesson, secondOfLesson, thirdOfLesson]]


let downWeekForFirstGroup : [String: [String]] =
    ["ПН" : ["Цивільне право", "Цивільне право(семінар)", "Конституційне право"],
     "ВТ" : ["Фінансове право", "Нотаріат в Україні(семінар)", "Нотаріат в Україні"],
     "СР" : ["Кримінальне право", "Екологічне право(семінар)", "Екологічне право"],
     "ЧТ" : ["Адміністративне право", "-", "-"],
     "ПТ" : ["Адвокатура", "Право соціального захисту", "Право соціального захисту(семінар)"]]

                                          //Предметы  второй курс-2 группа

let upWeekForSecondGroup : [String: [String]] =
    ["ПН" : ["Цивільне право", "Цивільне право(семінар)", "Конституційне право"],
     "ВТ" : ["Фінансове право", "Нотаріат в Україні(семінар)", "Нотаріат в Україні"],
     "СР" : ["Кримінальне право", "Екологічне право(семінар)", "Екологічне право"],
     "ЧТ" : ["Адміністративне право", "-", "-"],
     "ПТ" : ["Адвокатура", "курс за вибором(семінар)", "Право соціального захисту(семінар)"]]

let downWeekForSecondGroup : [String: [String]] =
    ["ПН" : ["Цивільне право", "Конституційне право(семінар)", "Конституційне право"],
     "ВТ" : ["Фінансове право", "Фінансове право(семінар)", "Нотаріат в Україні"],
     "СР" : ["Кримінальне право", "Кримінальне право(семінар)", "Екологічне право"],
     "ЧТ" : ["Адміністративне право", "Адміністративне право(семінар)", "Адвокатура(семінар)"],
     "ПТ" : ["Адвокатура", "Право соціального захисту", "Право соціального захисту(семінар)"]]

                                          //Предметы  второй курс-3 группа

let upWeekForThirdGroup : [String: [String]] =
    ["ПН" : ["Цивільне право", "Фінансове право(семінар)", "Конституційне право"],
     "ВТ" : ["Фінансове право", "Конституційне право(семінар)", "Нотаріат в Україні"],
     "СР" : ["Кримінальне право", "Нотаріат в Україні(семінар)", "Екологічне право"],
     "ЧТ" : ["Адміністративне право", "Адвокатура(семінар)", "Кримінальне право(семінар)"],
     "ПТ" : ["Адвокатура", "курс за вибором(семінар)", "Право соціального захисту(семінар)"]]

let downWeekForThirdGroup : [String: [String]] =
    ["ПН" : ["Цивільне право", "Екологічне право(семінар)", "Конституційне право"],
     "ВТ" : ["Фінансове право", "Цивільне право(семінар)", "Нотаріат в Україні"],
     "СР" : ["Кримінальне право", "Адміністративне право(семінар)", "Екологічне право"],
     "ЧТ" : ["Адміністративне право", "-", "-"],
     "ПТ" : ["Адвокатура", "Право соціального захисту", "Право соціального захисту(семінар)"]]

                                            //Предметы  второй курс-4 группа

let upWeekForFourthGroup : [String: [String]] =
    ["ПН" : ["Цивільне право", "Екологічне право(семінар)", "Конституційне право"],
     "ВТ" : ["Фінансове право", "Цивільне право(семінар)", "Нотаріат в Україні"],
     "СР" : ["Кримінальне право", "Адміністративне право(семінар)", "Екологічне право"],
     "ЧТ" : ["Адміністративне право", "-", "-"],
     "ПТ" : ["Адвокатура", "курс за вибором(семінар)", "Право соціального захисту(семінар)"]]

let downWeekForFourthGroup : [String: [String]] =
    ["ПН" : ["Цивільне право", "Фінансове право(семінар)", "Конституційне право"],
     "ВТ" : ["Фінансове право", "Конституційне право(семінар)", "Нотаріат в Україні"],
     "СР" : ["Кримінальне право", "Нотаріат в Україні(семінар)", "Екологічне право"],
     "ЧТ" : ["Адміністративне право", "Адвокатура(семінар)", "Кримінальне право(семінар)"],
     "ПТ" : ["Адвокатура", "Право соціального захисту", "Право соціального захисту(семінар)"]]

                                            //Предметы  второй курс-5 группа

let upWeekForFifthGroup : [String: [String]] =
    ["ПН" : ["Цивільне право", "Кримінальне право(семінар)", "Конституційне право"],
     "ВТ" : ["Фінансове право", "-", "Нотаріат в Україні"],
     "СР" : ["Кримінальне право", "Адвокатура(семінар)", "Екологічне право"],
     "ЧТ" : ["Адміністративне право", "Конституційне право(семінар)", "Нотаріат в Україні(семінар)"],
     "ПТ" : ["Адвокатура", "курс за вибором(семінар)", "Право соціального захисту(семінар)"]]

let downWeekForFifthGroup : [String: [String]] =
    ["ПН" : ["Цивільне право", "Адміністративне право(семінар)", "Конституційне право"],
     "ВТ" : ["Фінансове право", "Цивільне право(семінар)", "Нотаріат в Україні"],
     "СР" : ["Кримінальне право", "Фінансове право(семінар)", "Екологічне право"],
     "ЧТ" : ["Адміністративне право", "Екологічне право(семінар)", "-"],
     "ПТ" : ["Адвокатура", "Право соціального захисту", "Право соціального захисту(семінар)"]]

                                          //Предметы  второй курс-6 группа

let upWeekForSixGroup : [String: [String]] =
    ["ПН" : ["Нотаріат в Україні(семінар)", "Eкологічне право", "Нотаріат в Україні"],
     "ВТ" : ["Фінансове право(семінар)", "Конституційне право(семінар)", "Цивільне право"],
     "СР" : ["Адміністративне право(семінар)", "Адміністративне право", "Кримінальне право"],
     "ЧТ" : ["-", "Конституційне право", "Адвокатура"],
     "ПТ" : ["Адвокатура(семінар)", "курс за вибором(семінар)", "Право соціального захисту(семінар)"]]

let downWeekForSixGroup : [String: [String]] =
    ["ПН" : ["Екологічне право(семінар))", "Eкологічне право", "Нотаріат в Україні"],
     "ВТ" : ["Фінансове право(семінар)", "Фінансове право(семінар)", "Цивільне право"],
     "СР" : ["Кримінальне право(семінар)", "Адміністративне право", "Кримінальне право"],
     "ЧТ" : ["Цивільне право(семінар)", "Конституційне право", "Адвокатура"],
     "ПТ" : ["-", "Право соціального захисту", "Право соціального захисту(семінар)"]]

                                           //Предметы  второй курс-7 группа

let upWeekForSevenGroup : [String: [String]] =
    ["ПН" : ["-", "Eкологічне право", "Нотаріат в Україні"],
     "ВТ" : ["Фінансове право(семінар)", "Фінансове право(семінар)", "Цивільне право"],
     "СР" : ["Кримінальне право(семінар)", "Адміністративне право", "Кримінальне право"],
     "ЧТ" : ["Цивільне право(семінар)", "Конституційне право", "Адвокатура"],
     "ПТ" : ["-", "курс за вибором(семінар)", "Право соціального захисту(семінар)"]]

let downWeekForSevenGroup : [String: [String]] =
    ["ПН" : ["Нотаріат в Україні(семінар)", "Eкологічне право", "Нотаріат в Україні"],
     "ВТ" : ["Фінансове право(семінар)", "Конституційне право(семінар)", "Цивільне право"],
     "СР" : ["Адміністративне право(семінар)", "Адміністративне право", "Кримінальне право"],
     "ЧТ" : ["Екологічне право(семінар)", "Конституційне право", "Адвокатура"],
     "ПТ" : ["Адвокатура(семінар)", "Право соціального захисту", "Право соціального захисту(семінар)"]]

                                           //Предметы  второй курс-8 группа

let upWeekForEightGroup : [String: [String]] =
    ["ПН" : ["Фінансове право(семінар)", "Eкологічне право", "Нотаріат в Україні"],
    "ВТ" : ["Фінансове право", "Кримінальне право(семінар)", "Цивільне право"],
    "СР" : ["Адвокатура(семінар)", "Адміністративне право", "Кримінальне право"],
    "ЧТ" : ["Конституційне право(семінар)", "Конституційне право(семінар)", "Адвокатура"],
    "ПТ" : ["Адміністративне право(семінар)", "курс за вибором(семінар)", "Право соціального захисту(семінар)"]]

let downWeekForEightGroup : [String: [String]] =
    ["ПН" : ["-", "Eкологічне право", "Нотаріат в Україні"],
     "ВТ" : ["Фінансове право", "Цивільне право(семінар)", "Цивільне право"],
     "СР" : ["Екологічне право(семінар)", "Адміністративне право", "Кримінальне право"],
     "ЧТ" : ["Нотаріат в Україні(семінар)", "Конституційне право", "Адвокатура"],
     "ПТ" : ["-", "Право соціального захисту", "Право соціального захисту(семінар)"]]

                                          //Предметы  второй курс-9 группа

let upWeekForNineGroup : [String: [String]] =
    ["ПН" : ["-", "Eкологічне право", "Нотаріат в Україні"],
     "ВТ" : ["Фінансове право", "Цивільне право(семінар)", "Цивільне право"],
     "СР" : ["Екологічне право (семінар)", "Адміністративне право", "Кримінальне право"],
     "ЧТ" : ["Нотаріат в Україні(семінар)", "Конституційне право(семінар)", "Адвокатура"],
     "ПТ" : ["-", "курс за вибором(семінар)", "Професійна етика(семінар)"]]

let downWeekForNineGroup : [String: [String]] =
    ["ПН" : ["Фінансове право(семінар)", "Eкологічне право", "Нотаріат в Україні"],
     "ВТ" : ["Фінансове право", "Кримінальне право(семінар)", "Цивільне право"],
     "СР" : ["Екологічне право(семінар)", "Адміністративне право", "Кримінальне право"],
     "ЧТ" : ["Конституційне право(семінар)", "Конституційне право", "Адвокатура"],
     "ПТ" : ["Адміністративне право(семінар)", "Професійна етика", "Професійна етика(семінар)"]]

                                         //Предметы  второй курс-10 группа

let upWeekForTenGroup : [String: [String]] =
    ["ПН" : ["Екологічне право(семінар)", "Eкологічне право", "Нотаріат в Україні"],
     "ВТ" : ["Фінансове право", "Адміністративне право(семінар)", "Цивільне право"],
     "СР" : ["Фінансове право(семінар)", "Адміністративне право", "Кримінальне право"],
     "ЧТ" : ["Кримінальне право(семінар)", "Конституційне право(семінар)", "Адвокатура"],
     "ПТ" : ["-", "курс за вибором(семінар)", "Професійна етика(семінар)"]]

let downWeekForTenGroup : [String: [String]] =
    ["ПН" : ["Цивільне право(семінар)", "Eкологічне право", "Нотаріат в Україні"],
     "ВТ" : ["Фінансове право", "Нотаріат в Україні(семінар)", "Цивільне право"],
     "СР" : ["-", "Адміністративне право", "Кримінальне право"],
     "ЧТ" : ["Адвокатура)", "Конституційне право", "Адвокатура"],
     "ПТ" : ["Конституційне право(семінар)", "Професійна етика", "Професійна етика(семінар)"]]

                                          //Предметы  второй курс-11 группа

let upWeekForElevenGroup : [String: [String]] =
    ["ПН" : ["Адвокатура", "-", "Екологічне право"],
     "ВТ" : ["Фінансове право(семінар)", "Конституційне право", "Конституційне право(семінар)"],
     "СР" : ["Цивільне право", "Цивільне право(семінар)", "Кримінальне право"],
     "ЧТ" : ["Фінансове право", "Адміністративне право", "Адміністративне право(семінар)"],
     "ПТ" : ["Нотаріат в Україні", "курс за вибором(семінар)", "Професійна етика(семінар)"]]

let downWeekForElevenGroup : [String: [String]] =
    ["ПН" : ["Адвокатура", "Нотаріат в Україні(семінар)", "Екологічне право"],
     "ВТ" : ["-", "Конституційне право", "Кримінальне право(семінар)"],
     "СР" : ["Цивільне право", "Адвокатура(семінар)", "Кримінальне право"],
     "ЧТ" : ["Фінансове право", "Адміністративне право", "Екологічне право(семінар)"],
     "ПТ" : ["Нотаріат в Україні", "Професійна етика", "Професійна етика(семінар)"]]

                                         //Предметы  второй курс-12 группа

let upWeekForTwelveGroup : [String: [String]] =
    ["ПН" : ["Адвокатура", "Нотаріат в Україні(семінар)", "Екологічне право"],
     "ВТ" : ["-", "Конституційне право", "Кримінальне право(семінар)"],
     "СР" : ["Цивільне право", "Адвокатура(семінар)", "Кримінальне право"],
     "ЧТ" : ["Фінансове право", "Адміністративне право", "Екологічне право(семінар)"],
     "ПТ" : ["Нотаріат в Україні", "курс за вибором(семінар)", "Професійна етика(семінар)"]]

let downWeekForTwelveGroup : [String: [String]] =
    ["ПН" : ["Адвокатура", "-", "Екологічне право"],
     "ВТ" : ["Фінансове право(семінар)", "Конституційне право", "Конституційне право(семінар)"],
     "СР" : ["Цивільне право", "Цивільне право(семінар)", "Кримінальне право"],
     "ЧТ" : ["Фінансове право", "Адміністративне право", "Адміністративне право(семінар)"],
     "ПТ" : ["Нотаріат в Україні", "Професійна етика", "Професійна етика(семінар)"]]


                                        //Предметы  второй курс-13 группа

let upWeekForThirteenGroup : [String: [String]] =
    ["ПН" : ["Адвокатура", "Адвокатура (семінар)", "Екологічне право"],
     "ВТ" : ["-", "Конституційне право", "Екологічне право(семінар)"],
     "СР" : ["Цивільне право", "Цивільне право(семінар)", "Кримінальне право"],
     "ЧТ" : ["Фінансове право", "Адміністративне право", "Конституційне право(семінар)"],
     "ПТ" : ["Нотаріат в Україні", "курс за вибором(семінар)", "Професійна етика(семінар)"]]

let downWeekForThirteenGroup : [String: [String]] =
    ["ПН" : ["Адвокатура", "Кримінальне право(семінар)", "Екологічне право"],
     "ВТ" : ["-", "Конституційне право", "Фінансове право(семінар)"],
     "СР" : ["Цивільне право", "Адміністративне право(семінар)", "Кримінальне право"],
     "ЧТ" : ["Фінансове право", "Адміністративне право", "Нотаріат в Україні(семінар)"],
     "ПТ" : ["Нотаріат в Україні", "Професійна етика", "Професійна етика(семінар)"]]

                                       //Предметы  второй курс-14 группа

let upWeekForFourteenGroup : [String: [String]] =
    ["ПН" : ["Адвокатура", "Адміністративне право (семінар)", "Екологічне право"],
     "ВТ" : ["-", "Конституційне право", "Фінансове право(семінар)"],
     "СР" : ["Цивільне право", "Кримінальне право(семінар)", "Кримінальне право"],
     "ЧТ" : ["Фінансове право", "Адміністративне право", "Нотаріат в Україні(семінар)"],
     "ПТ" : ["Нотаріат в Україні", "курс за вибором(семінар)", "Професійна етика(семінар)"]]

let downWeekForFourteenGroup : [String: [String]] =
    ["ПН" : ["Адвокатура", "Адвокатура(семінар)", "Екологічне право"],
     "ВТ" : ["Цивільне право(семінар)", "Конституційне право", "Екологічне право(семінар)"],
     "СР" : ["Цивільне право", "-", "Кримінальне право"],
     "ЧТ" : ["Фінансове право", "Адміністративне право", "Конституційне право(семінар)"],
     "ПТ" : ["Нотаріат в Україні", "Професійна етика", "Професійна етика(семінар)"]]
